app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.find_all_by_user_id(@user)
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."user_id" = 'user_id'

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = 0 LIMIT 1

  def edit
    @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = 1 LIMIT 1

  def create
    @gallery = Gallery.new(params[:gallery])

    respond_to do |format|
      if @gallery.save
---
INSERT INTO "galleries" ("name", "description", "created_at", "updated_at", "gallery_id", "user_id") VALUES ('New Gallery', 'Test Gallery', '2011-09-25 01:17:24.971451', '2011-09-25 01:17:24.971451', NULL, NULL)

  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = 1 LIMIT 1
DELETE FROM "galleries" WHERE "galleries"."id" = 1