app/controllers/phots_controller.rb

SELECT "phots".* FROM "phots"
---
  def index
    @phots = Phot.all

SELECT "phots".* FROM "phots" WHERE "phots"."id" = 1 LIMIT 1
---
  def show
    @phot = Phot.find(params[:id])

SELECT "phots".* FROM "phots" WHERE "phots"."id" = 12 LIMIT 1
---
  def edit
    @phot = Phot.find(params[:id])

INSERT INTO "phots" ("image_name", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "album_id") VALUES ('test', '2011-09-25 01:20:01.760451', '2011-09-25 01:20:01.760451', 'DSC_0545.JPG', 'image/jpeg', 1354899, '2011-09-25 01:20:01.308451', NULL)
---
  def create
    @phot = Phot.new(params[:phot])

    respond_to do |format|
      if @phot.save

SELECT "phots".* FROM "phots" WHERE "phots"."id" = 27 LIMIT 1
UPDATE "phots" SET "image_name" = 'Truck', "image_updated_at" = '2011-09-24 22:43:49.059451', "updated_at" = '2011-09-24 22:43:49.347451' WHERE "phots"."id" = 27
---
  def update
    @phot = Phot.find(params[:id])

    respond_to do |format|
      if @phot.update_attributes(params[:phot])

SELECT "phots".* FROM "phots" WHERE "phots"."id" = 1 LIMIT 1
DELETE FROM "phots" WHERE "phots"."id" = 1
---
  def destroy
    @phot = Phot.find(params[:id])
    @phot.destroy