app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email_id", "hashed_password", "salt", "created_at", "updated_at") VALUES ('Sanjay', 'Parab', 'sanjay.parab@gmail.com', '123', '123', '2011-09-16 22:49:59.405129', '2011-09-16 22:49:59.405129')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save